Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/sqi.h
/* -------- SQI_CLKCON : (SQI Offset: 0x110) (R/W 32) SPI Clock Control register -------- */
#define SQI_CLKCON_RESETVALUE                 _UINT32_(0x01)                                       /*  (SQI_CLKCON) SPI Clock Control register  Reset Value */

#define SQI_CLKCON_EN_Pos                     _UINT32_(0)                                          /* (SQI_CLKCON) This bit is set to 0 when the SPI Driver is not using the SPI Controller. The SPI  Controller should stop its internal clock to go very low power state. Still, registers  will be able to be read and written. Clock starts to oscillate when this bit is set to 1. When clock oscillation is stable, the SPI Controller will set Internal Clock Stable in this register to 1. 1 - Enable 0 - Disable Position */
#define SQI_CLKCON_EN_Msk                     (_UINT32_(0x1) << SQI_CLKCON_EN_Pos)                 /* (SQI_CLKCON) This bit is set to 0 when the SPI Driver is not using the SPI Controller. The SPI  Controller should stop its internal clock to go very low power state. Still, registers  will be able to be read and written. Clock starts to oscillate when this bit is set to 1. When clock oscillation is stable, the SPI Controller will set Internal Clock Stable in this register to 1. 1 - Enable 0 - Disable Mask */
#define SQI_CLKCON_EN(value)                  (SQI_CLKCON_EN_Msk & (_UINT32_(value) << SQI_CLKCON_EN_Pos)) /* Assigment of value for EN in the SQI_CLKCON register */
#define SQI_CLKCON_STABLE_Pos                 _UINT32_(1)                                          /* (SQI_CLKCON) After Reset, this bit is set to 1 when SPI Clock  is  stable  after  writing  Internal Clock  Enable  in  this  register  to  1. The Clock  Stable  indication  will  continue unless   the   Clock   Divisor   Value   is changed, in which case it will wait until Clock is stable again. Stability is reached when the Clock Divisor period has been reached. The SPI Host Driver should wait until this bit is set to 1 (and the Enable is 1) before programming the SPI Control register. 1 - Stable 0 - Not stable Position */
#define SQI_CLKCON_STABLE_Msk                 (_UINT32_(0x1) << SQI_CLKCON_STABLE_Pos)             /* (SQI_CLKCON) After Reset, this bit is set to 1 when SPI Clock  is  stable  after  writing  Internal Clock  Enable  in  this  register  to  1. The Clock  Stable  indication  will  continue unless   the   Clock   Divisor   Value   is changed, in which case it will wait until Clock is stable again. Stability is reached when the Clock Divisor period has been reached. The SPI Host Driver should wait until this bit is set to 1 (and the Enable is 1) before programming the SPI Control register. 1 - Stable 0 - Not stable Mask */
#define SQI_CLKCON_STABLE(value)              (SQI_CLKCON_STABLE_Msk & (_UINT32_(value) << SQI_CLKCON_STABLE_Pos)) /* Assigment of value for STABLE in the SQI_CLKCON register */
#define SQI_CLKCON_CLKDIV_Pos                 _UINT32_(8)                                          /* (SQI_CLKCON) SPI Clock Frequency Select 400h - base clock divided by 2048 ,200h - base clock divided by 1024  ,100h - base clock divided by 512 ,080h - base clock divided by 256 ,040h - base clock divided by 128 ,020h - base clock divided by 64 ,010h - base clock divided by 32 ,008h - base clock divided by 16 ,004h - base clock divided by 8 ,002h - base clock divided by 4 ,001h - base clock divided by 2 ,000h - base clock Setting 000h specifies the highest frequency of the SPI Clock. NOTE:  When  DDR  mode  is  active,  the output SPI_CLK is further divided by two (so that internal clocking remains rise edge active internally)  Max output SPI_CLK for DDR is 66Mhz. Position */
#define SQI_CLKCON_CLKDIV_Msk                 (_UINT32_(0x7FF) << SQI_CLKCON_CLKDIV_Pos)           /* (SQI_CLKCON) SPI Clock Frequency Select 400h - base clock divided by 2048 ,200h - base clock divided by 1024  ,100h - base clock divided by 512 ,080h - base clock divided by 256 ,040h - base clock divided by 128 ,020h - base clock divided by 64 ,010h - base clock divided by 32 ,008h - base clock divided by 16 ,004h - base clock divided by 8 ,002h - base clock divided by 4 ,001h - base clock divided by 2 ,000h - base clock Setting 000h specifies the highest frequency of the SPI Clock. NOTE:  When  DDR  mode  is  active,  the output SPI_CLK is further divided by two (so that internal clocking remains rise edge active internally)  Max output SPI_CLK for DDR is 66Mhz. Mask */
#define SQI_CLKCON_CLKDIV(value)              (SQI_CLKCON_CLKDIV_Msk & (_UINT32_(value) << SQI_CLKCON_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the SQI_CLKCON register */
#define SQI_CLKCON_Msk                        _UINT32_(0x0007FF03)                                 /* (SQI_CLKCON) Register Mask  */


/* -------- SQI_CMDTHR : (SQI Offset: 0x114) (R/W 32) SPI command threshold register -------- */
#define SQI_CMDTHR_RESETVALUE                 _UINT32_(0x101)                                      /*  (SQI_CMDTHR) SPI command threshold register  Reset Value */

#define SQI_CMDTHR_RXCMDTHR_Pos               _UINT32_(0)                                          /* (SQI_CMDTHR) In RX initiation mode, SPI attempts to perform receive fetch operations until RX_CMD_THRES bytes of space remain in the receive buffer. If space for RX_CMD_THRES bytes is not present in the FIFO, then SPI would not initiate any transfer. RX_CMD_THRES should only be programmed when RX is not active, during IDLE or TX. Please note that if S/W performs any reads, thereby reducing the FIFO count, then HW would initiate RX transfer to get back FIFO count equal to RX_CMD_THRES. If S/W would not like any more words latched into FIFO, then command initiation mode needs to be changed to IDLE before any FIFO reads by S/W. In case of Boot/XIP mode, the SPI Controller uses the AHB Burst size, instead of RX CMD Threshold value. Position */
#define SQI_CMDTHR_RXCMDTHR_Msk               (_UINT32_(0xFF) << SQI_CMDTHR_RXCMDTHR_Pos)          /* (SQI_CMDTHR) In RX initiation mode, SPI attempts to perform receive fetch operations until RX_CMD_THRES bytes of space remain in the receive buffer. If space for RX_CMD_THRES bytes is not present in the FIFO, then SPI would not initiate any transfer. RX_CMD_THRES should only be programmed when RX is not active, during IDLE or TX. Please note that if S/W performs any reads, thereby reducing the FIFO count, then HW would initiate RX transfer to get back FIFO count equal to RX_CMD_THRES. If S/W would not like any more words latched into FIFO, then command initiation mode needs to be changed to IDLE before any FIFO reads by S/W. In case of Boot/XIP mode, the SPI Controller uses the AHB Burst size, instead of RX CMD Threshold value. Mask */
#define SQI_CMDTHR_RXCMDTHR(value)            (SQI_CMDTHR_RXCMDTHR_Msk & (_UINT32_(value) << SQI_CMDTHR_RXCMDTHR_Pos)) /* Assigment of value for RXCMDTHR in the SQI_CMDTHR register */
#define SQI_CMDTHR_TXCMDTHR_Pos               _UINT32_(8)                                          /* (SQI_CMDTHR) In TX Initiation Mode, SPI Performs a transmit Operation when TX_CMD_THRES bytes are present in the TX FIFO. This should usually be set to 1 for normal flash commands, and is desired to be set to a higher value for page programming. NOTE: Value of 8?d0 should be treated as Reserved (illegal) for this field. May produce unexpected activity on SPI bus. Furthermore, values should generally be limited to EVEN values (excepting a value  of 1), and MUST be so limited in DMA mode. Position */
#define SQI_CMDTHR_TXCMDTHR_Msk               (_UINT32_(0xFF) << SQI_CMDTHR_TXCMDTHR_Pos)          /* (SQI_CMDTHR) In TX Initiation Mode, SPI Performs a transmit Operation when TX_CMD_THRES bytes are present in the TX FIFO. This should usually be set to 1 for normal flash commands, and is desired to be set to a higher value for page programming. NOTE: Value of 8?d0 should be treated as Reserved (illegal) for this field. May produce unexpected activity on SPI bus. Furthermore, values should generally be limited to EVEN values (excepting a value  of 1), and MUST be so limited in DMA mode. Mask */
#define SQI_CMDTHR_TXCMDTHR(value)            (SQI_CMDTHR_TXCMDTHR_Msk & (_UINT32_(value) << SQI_CMDTHR_TXCMDTHR_Pos)) /* Assigment of value for TXCMDTHR in the SQI_CMDTHR register */
#define SQI_CMDTHR_Msk                        _UINT32_(0x0000FFFF)                                 /* (SQI_CMDTHR) Register Mask  */


/* -------- SQI_INTTHR : (SQI Offset: 0x118) (R/W 32) SPI Interrupt Threshold register -------- */
#define SQI_INTTHR_RESETVALUE                 _UINT32_(0x00)                                       /*  (SQI_INTTHR) SPI Interrupt Threshold register  Reset Value */

#define SQI_INTTHR_RXINTTHR_Pos               _UINT32_(0)                                          /* (SQI_INTTHR) Receive Interrupt is set when Receive FIFO CNT is larger than or equal to RX_INT_THRES Value. Position */
#define SQI_INTTHR_RXINTTHR_Msk               (_UINT32_(0xFF) << SQI_INTTHR_RXINTTHR_Pos)          /* (SQI_INTTHR) Receive Interrupt is set when Receive FIFO CNT is larger than or equal to RX_INT_THRES Value. Mask */
#define SQI_INTTHR_RXINTTHR(value)            (SQI_INTTHR_RXINTTHR_Msk & (_UINT32_(value) << SQI_INTTHR_RXINTTHR_Pos)) /* Assigment of value for RXINTTHR in the SQI_INTTHR register */
#define SQI_INTTHR_TXINTTHR_Pos               _UINT32_(8)                                          /* (SQI_INTTHR) Transmit Interrupt is set when Transmit FIFO has equal or more space than TX_INT_THRES bytes. Position */
#define SQI_INTTHR_TXINTTHR_Msk               (_UINT32_(0xFF) << SQI_INTTHR_TXINTTHR_Pos)          /* (SQI_INTTHR) Transmit Interrupt is set when Transmit FIFO has equal or more space than TX_INT_THRES bytes. Mask */
#define SQI_INTTHR_TXINTTHR(value)            (SQI_INTTHR_TXINTTHR_Msk & (_UINT32_(value) << SQI_INTTHR_TXINTTHR_Pos)) /* Assigment of value for TXINTTHR in the SQI_INTTHR register */
#define SQI_INTTHR_Msk                        _UINT32_(0x0000FFFF)                                 /* (SQI_INTTHR) Register Mask  */


/* -------- SQI_INTEN : (SQI Offset: 0x11C) (R/W 32) SPI Interrupt Enable Register -------- */
#define SQI_INTEN_RESETVALUE                  _UINT32_(0xAD)                                       /*  (SQI_INTEN) SPI Interrupt Enable Register  Reset Value */

#define SQI_INTEN_TXEMPTYIE_Pos               _UINT32_(0)                                          /* (SQI_INTEN) TX FIFO Empty Interrupt Enable. Position */
#define SQI_INTEN_TXEMPTYIE_Msk               (_UINT32_(0x1) << SQI_INTEN_TXEMPTYIE_Pos)           /* (SQI_INTEN) TX FIFO Empty Interrupt Enable. Mask */
#define SQI_INTEN_TXEMPTYIE(value)            (SQI_INTEN_TXEMPTYIE_Msk & (_UINT32_(value) << SQI_INTEN_TXEMPTYIE_Pos)) /* Assigment of value for TXEMPTYIE in the SQI_INTEN register */
#define SQI_INTEN_TXFULLIE_Pos                _UINT32_(1)                                          /* (SQI_INTEN) TX FIFO Full Interrupt Enable. Position */
#define SQI_INTEN_TXFULLIE_Msk                (_UINT32_(0x1) << SQI_INTEN_TXFULLIE_Pos)            /* (SQI_INTEN) TX FIFO Full Interrupt Enable. Mask */
#define SQI_INTEN_TXFULLIE(value)             (SQI_INTEN_TXFULLIE_Msk & (_UINT32_(value) << SQI_INTEN_TXFULLIE_Pos)) /* Assigment of value for TXFULLIE in the SQI_INTEN register */
#define SQI_INTEN_TXTHRIE_Pos                 _UINT32_(2)                                          /* (SQI_INTEN) Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words. Position */
#define SQI_INTEN_TXTHRIE_Msk                 (_UINT32_(0x1) << SQI_INTEN_TXTHRIE_Pos)             /* (SQI_INTEN) Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words. Mask */
#define SQI_INTEN_TXTHRIE(value)              (SQI_INTEN_TXTHRIE_Msk & (_UINT32_(value) << SQI_INTEN_TXTHRIE_Pos)) /* Assigment of value for TXTHRIE in the SQI_INTEN register */
#define SQI_INTEN_RXEMPTYIE_Pos               _UINT32_(3)                                          /* (SQI_INTEN) RX FIFO Empty Interrupt Enable. Position */
#define SQI_INTEN_RXEMPTYIE_Msk               (_UINT32_(0x1) << SQI_INTEN_RXEMPTYIE_Pos)           /* (SQI_INTEN) RX FIFO Empty Interrupt Enable. Mask */
#define SQI_INTEN_RXEMPTYIE(value)            (SQI_INTEN_RXEMPTYIE_Msk & (_UINT32_(value) << SQI_INTEN_RXEMPTYIE_Pos)) /* Assigment of value for RXEMPTYIE in the SQI_INTEN register */
#define SQI_INTEN_RXFULLIE_Pos                _UINT32_(4)                                          /* (SQI_INTEN) RX FIFO Full Interrupt Enable. Position */
#define SQI_INTEN_RXFULLIE_Msk                (_UINT32_(0x1) << SQI_INTEN_RXFULLIE_Pos)            /* (SQI_INTEN) RX FIFO Full Interrupt Enable. Mask */
#define SQI_INTEN_RXFULLIE(value)             (SQI_INTEN_RXFULLIE_Msk & (_UINT32_(value) << SQI_INTEN_RXFULLIE_Pos)) /* Assigment of value for RXFULLIE in the SQI_INTEN register */
#define SQI_INTEN_RXTHRIE_Pos                 _UINT32_(5)                                          /* (SQI_INTEN) Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power  on reset, till a read request on the AHB Bus. Position */
#define SQI_INTEN_RXTHRIE_Msk                 (_UINT32_(0x1) << SQI_INTEN_RXTHRIE_Pos)             /* (SQI_INTEN) Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power  on reset, till a read request on the AHB Bus. Mask */
#define SQI_INTEN_RXTHRIE(value)              (SQI_INTEN_RXTHRIE_Msk & (_UINT32_(value) << SQI_INTEN_RXTHRIE_Pos)) /* Assigment of value for RXTHRIE in the SQI_INTEN register */
#define SQI_INTEN_CONFULLIE_Pos               _UINT32_(6)                                          /* (SQI_INTEN) Control Buffer Full Interrupt Enable Position */
#define SQI_INTEN_CONFULLIE_Msk               (_UINT32_(0x1) << SQI_INTEN_CONFULLIE_Pos)           /* (SQI_INTEN) Control Buffer Full Interrupt Enable Mask */
#define SQI_INTEN_CONFULLIE(value)            (SQI_INTEN_CONFULLIE_Msk & (_UINT32_(value) << SQI_INTEN_CONFULLIE_Pos)) /* Assigment of value for CONFULLIE in the SQI_INTEN register */
#define SQI_INTEN_CONEMPTYIE_Pos              _UINT32_(7)                                          /* (SQI_INTEN) Control Buffer Empty Interrupt Enable Position */
#define SQI_INTEN_CONEMPTYIE_Msk              (_UINT32_(0x1) << SQI_INTEN_CONEMPTYIE_Pos)          /* (SQI_INTEN) Control Buffer Empty Interrupt Enable Mask */
#define SQI_INTEN_CONEMPTYIE(value)           (SQI_INTEN_CONEMPTYIE_Msk & (_UINT32_(value) << SQI_INTEN_CONEMPTYIE_Pos)) /* Assigment of value for CONEMPTYIE in the SQI_INTEN register */
#define SQI_INTEN_CONTHRIE_Pos                _UINT32_(8)                                          /* (SQI_INTEN) Control Buffer Threshold Interrupt Enable Position */
#define SQI_INTEN_CONTHRIE_Msk                (_UINT32_(0x1) << SQI_INTEN_CONTHRIE_Pos)            /* (SQI_INTEN) Control Buffer Threshold Interrupt Enable Mask */
#define SQI_INTEN_CONTHRIE(value)             (SQI_INTEN_CONTHRIE_Msk & (_UINT32_(value) << SQI_INTEN_CONTHRIE_Pos)) /* Assigment of value for CONTHRIE in the SQI_INTEN register */
#define SQI_INTEN_BDDONEIE_Pos                _UINT32_(9)                                          /* (SQI_INTEN) Current Buffer Descriptor Interrupt Enable Position */
#define SQI_INTEN_BDDONEIE_Msk                (_UINT32_(0x1) << SQI_INTEN_BDDONEIE_Pos)            /* (SQI_INTEN) Current Buffer Descriptor Interrupt Enable Mask */
#define SQI_INTEN_BDDONEIE(value)             (SQI_INTEN_BDDONEIE_Msk & (_UINT32_(value) << SQI_INTEN_BDDONEIE_Pos)) /* Assigment of value for BDDONEIE in the SQI_INTEN register */
#define SQI_INTEN_PKTCOMPIE_Pos               _UINT32_(10)                                         /* (SQI_INTEN) Packet completion Interrupt Position */
#define SQI_INTEN_PKTCOMPIE_Msk               (_UINT32_(0x1) << SQI_INTEN_PKTCOMPIE_Pos)           /* (SQI_INTEN) Packet completion Interrupt Mask */
#define SQI_INTEN_PKTCOMPIE(value)            (SQI_INTEN_PKTCOMPIE_Msk & (_UINT32_(value) << SQI_INTEN_PKTCOMPIE_Pos)) /* Assigment of value for PKTCOMPIE in the SQI_INTEN register */
#define SQI_INTEN_DMAEIE_Pos                  _UINT32_(11)                                         /* (SQI_INTEN) Master Error Interrupt Enable Position */
#define SQI_INTEN_DMAEIE_Msk                  (_UINT32_(0x1) << SQI_INTEN_DMAEIE_Pos)              /* (SQI_INTEN) Master Error Interrupt Enable Mask */
#define SQI_INTEN_DMAEIE(value)               (SQI_INTEN_DMAEIE_Msk & (_UINT32_(value) << SQI_INTEN_DMAEIE_Pos)) /* Assigment of value for DMAEIE in the SQI_INTEN register */
#define SQI_INTEN_Msk                         _UINT32_(0x00000FFF)                                 /* (SQI_INTEN) Register Mask  */


